bench/results/20260917T203432Z-cursor-scaled20/raw/light/http/c/round1/c200.wrk.txt
Running 30s test @ http://127.0.0.1:18300/
  1 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.11ms  598.05us   9.00ms   84.91%
    Req/Sec    35.91k     2.67k   41.63k    81.61%
  Latency Distribution
     50%    1.00ms
     75%    1.31ms
     90%    1.65ms
     99%    3.79ms
  1073168 requests in 30.04s, 291.68MB read
Requests/sec:  35719.25
Transfer/sec:      9.71MB